#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cloudsbits/audiotube-sandbox/runs/run-cf3myNP1ZNMz4J1N

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.org: Refreshing...
data.terraform_remote_state.org: Refresh complete after 1s
data.aws_caller_identity.current: Refreshing...
module.ecr_disabled.data.aws_caller_identity.current: Refreshing...
module.ecr_registry.aws_ecr_registry_scanning_configuration.this[0]: Refreshing state... [id=257625454150]
module.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=cloudsbits-audiotube-sandbox]
aws_iam_openid_connect_provider.github_oidc: Refreshing state... [id=arn:aws:iam::257625454150:oidc-provider/token.actions.githubusercontent.com]
module.ecr.data.aws_caller_identity.current: Refreshing...
module.ecr_registry.data.aws_partition.current: Refreshing...
module.ecr_registry.data.aws_caller_identity.current: Refreshing...
module.ecr_disabled.data.aws_partition.current: Refreshing...
module.ecr_registry.data.aws_partition.current: Refresh complete after 0s [id=aws]
data.aws_partition.current: Refreshing...
module.ecr.data.aws_partition.current: Refreshing...
data.aws_partition.current: Refresh complete after 0s [id=aws]
module.ecr_disabled.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.ecr.data.aws_partition.current: Refresh complete after 0s [id=aws]
data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
module.ecr_disabled.data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
module.ecr_registry.data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
module.ecr.data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
module.ecr.data.aws_iam_policy_document.repository[0]: Refreshing...
module.ecr.data.aws_iam_policy_document.repository[0]: Refresh complete after 0s [id=2476401238]
data.aws_iam_policy_document.github_allow: Refreshing...
data.aws_iam_policy_document.github_allow: Refresh complete after 0s [id=1807041875]
aws_iam_role.github_role: Refreshing state... [id=GithubActionsRole]
module.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=cloudsbits-audiotube-sandbox]
module.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=cloudsbits-audiotube-sandbox]
data.aws_iam_policy_document.registry: Refreshing...
data.aws_iam_policy_document.registry: Refresh complete after 0s [id=2876457901]
module.ecr_registry.aws_ecr_registry_policy.this[0]: Refreshing state... [id=257625454150]
aws_iam_openid_connect_provider.github_oidc: Drift detected (update)
aws_iam_role.github_role: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.ecr_policy will be created
  + resource "aws_iam_policy" "ecr_policy" {
      + arn         = (known after apply)
      + description = "Policy that allows ECR access"
      + id          = (known after apply)
      + name        = "ecr_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:DescribeRepositories",
                          + "ecr:ListImages",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:ListTagsForResource",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:PutImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.github_role_ecr_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "github_role_ecr_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GithubActionsRole"
    }

  # module.ecr.aws_ecr_repository_policy.this[0] will be updated in-place
  ~ resource "aws_ecr_repository_policy" "this" {
        id          = "cloudsbits-audiotube-sandbox"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:sts::257625454150:assumed-role/Org-Admin/aws-go-sdk-1689656540564489423" -> "arn:aws:sts::257625454150:assumed-role/Org-Admin/aws-go-sdk-1689688998346098278"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:sts::257625454150:assumed-role/Org-Admin/aws-go-sdk-1689656540564489423" -> "arn:aws:sts::257625454150:assumed-role/Org-Admin/aws-go-sdk-1689688998346098278"
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 4 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @Kostua, Action: `pull_request`*